Autodesk.Revit.DB.DetailElementOrderUtils.AreDetailElements(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Indicates whether the given elements are all detail elements.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of detail elementIds to check.
Returns:
True if it is a set of detail elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.IsDetailElement(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Indicates if the given element is a detail element.
pDocument:
The document.
pDBView:
The view.
detailElementId:
The detail elementId
Returns:
True if it is a detail element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.SendBackward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Moves the given detail instances one step closer to the back with relation to all other detail
instances in the view, while keeping the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of the detail elementIds to move backward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.SendBackward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Moves the given detail instance one step closer to the back of all other detail instances in the view.
pDocument:
The document.
pDBView:
The view.
detailElementId:
The detail elementId to move backward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element detailElementId is not a detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.SendToBack(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Places the given detail instances behind all other detail instances in the view, while keeping
the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of the detail elementIds to send to back.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.SendToBack(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Places the given detail instance behind all detail instances in the view.
pDocument:
The document.
pDBView:
The view.
detailElementId:
The detail elementId to send to back.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element detailElementId is not a detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.BringForward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Moves the given detail instances one step closer to the front of all other detail instances in the view,
while keeping the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of detail elementIds to bring forward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.BringForward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Moves the given detail instance one step closer to the front of all other detail instances in the view.
pDocument:
The document.
pDBView:
The view.
detailElementId:
The detail elementId to bring forward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element detailElementId is not a detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils.BringToFront(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Places the given detail instances in the front of all other detail instances in the view, while
keeping the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of detail elementIds to bring to front.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.BringToFront(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Places the given detail instance in the front of all other detail instances in the view.
pDocument:
The document.
pDBView:
The view.
detailElementId:
The detail elementId
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element detailElementId is not a detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.DetailElementOrderUtils
A utility class that arranges the draw order of the detail objects.
Since:
2013